// beatmaps.js
export const beatmaps = {
    easy: [                                                             //Don = W/RED,   Ka = E/BLUE
        {
            name: "Vancouver Island", //750
            bpm: 150,
            offset: 0,
            "beats-don": [0.6, 1.6, 4.0, 5.1, 7.0, 8.0, 13.7, 14.7, 20, 21.3, 22.1, 23.7, 26, 26.8, 27.3],
            music: "audio/vancouver.mp3",
        },
        {
            name: "Kenai River, Alaska", //750
            bpm: 80,
            offset: 0,
            "beats-ka": [1, 1.9, 2.4, 4.9, 5.8, 6.6, 7.6, 8.5, 9.7, 10.8, 11.3, 12.8, 13.7, 14.8, 15.5],
            music: "audio/kenai.mp3",
        },
        {
            name: "Lake Michigan", //750
            bpm: 100,
            offset: 0,
            "beats-don": [0.8, 1.8, 2.8, 3.8, 12.8, 13.8, 14.8, 15.8 ],
            "beats-ka": [6.8, 7.8, 8.8, 9.8, 18.5, 19.5, 20.5],
            music: "audio/michigan.mp3",
        },
        {
            name: "Key West, Florida", //750
            bpm: 140,
            offset: 0,
            "beats-don": [1.4, 3.4, 3.9, 4.7, 5.6, 6.4, 7.3, 8.3, 8.7],
            "beats-ka": [9.9, 11.1, 12.5, 14, 15.3, 16.2, 16.9, 18.4, 19.6, 20.1, 20.7],
            music: "audio/keywest.mp3",
        }
    ],
    medium: [
        {
            name: "Jeju Island (제주도)", //2050
            bpm: 128, //Mr. Simple
            offset: 0,
            "beats-don": [2, 7, 7.5, 8, 12, 13, 14, 15, 16, 17, 18, 20, 21, 22, 23, 24, 25, 26.3, 35],
            "beats-ka": [1.5, 3, 3.5, 4, 11, 19, 25.8, 27, 28, 29, 30, 31, 32, 33, 34, 36, 37, 38, 39, 40, 41, 42 ],
            music: "audio/jeju_island.mp3",
        },
        {
            name: "Yangtze River (长江)", //1600
            bpm: 137, //Super Idol
            offset: 0,
            "beats-don": [3.7, 5.2, 7.8, 9.5, 10.4, 11.9, 13.4, 15.9, 17.4, 18.3, 19.9, 21.4, 23.9, 25.4, 26.4  ],
            "beats-ka": [0, 1, 1.9, 2.4, 2.9, 4.7, 6.7, 8.9, 10.9, 12.9, 14.9, 16.9, 18.9, 20.9, 22.9, 24.7, 26.9 ],
            music: "audio/yangtze.mp3",
        },
        {
            name: "Okinawa Islands (沖縄諸島)", //2050
            bpm: 128, //PONPONPON
            offset: 0,
            "beats-don": [0.5, 3.5, 7.5, 8.5, 12, 16.2, 17.2, 19.5, 21.5, 24.3, 25.3, 26.3, 27.5, 28.5, 29.5, 30.5, 34.5, 34.8, 35.4, 38],
            "beats-ka": [1.5, 2.5, 5, 5.5, 7.8, 9, 9.5, 10.5, 10.9, 13.5, 17.8, 18.4, 20.5, 22.5, 23.2, 32.5, 33.5, 36.3, 37, 38.5, 39.5],
            music: "audio/okinawa.mp3",
        },
        {
            name: "Taal Lake", //1700
            bpm: 104, //Multo
            offset: 0,
            "beats-don": [1, 3, 4.5, 5, 7, 9, 10, 12, 14, 16, 18, 20, 22, 24, 26, 27],
            "beats-ka": [0, 2, 4, 6, 8, 10.5, 11, 13, 15, 15.5, 17, 19, 20.5, 21, 21.5, 22.5, 23, 25,],
            music: "audio/taal.mp3",
        }
    ],
    hard: [
        {
            name: "Amazon River Basin", //1800
            bpm: 130, // Samba Do Brasil
            offset: 0,
            "beats-don": [1, 3.5, 5, 7.5, 8, 9, 10, 10.5, 11.5, 12.5, 14, 16.5, 17.5, 19.5, 20.5, 21, 22.5,],
            "beats-ka": [0, 0.5, 3, 4, 4.5, 6, 7, 8.5, 9.5, 11, 12, 13, 13.5, 16, 17, 19, 20, 22, 23],
            music: "audio/amazon.mp3",
        },
        {
            name: "Rio Paraná", //
            bpm: 137, //
            offset: 0,
            "beats-don": [3.7, 5.2, 7.8, 9.5, 10.4, 11.9, 13.4, 15.9, 17.4, 18.3, 19.9, 21.4, 23.9, 25.4, 26.4  ],
            "beats-ka": [0, 1, 1.9, 2.4, 2.9, 4.7, 6.7, 8.9, 10.9, 12.9, 14.9, 16.9, 18.9, 20.9, 22.9, 24.7, 26.9 ],
            music: "audio/yangtze.mp3",
        },
        {
            name: "Zambezi River", //
            bpm: 128, //
            offset: 0,
            "beats-don": [0.5, 3.5, 7.5, 8.5, 12, 16.2, 17.2, 19.5, 21.5, 24.3, 25.3, 26.3, 27.5, 28.5, 29.5, 30.5, 34.5, 34.8, 35.4, 38],
            "beats-ka": [1.5, 2.5, 5, 5.5, 7.8, 9, 9.5, 10.5, 10.9, 13.5, 17.8, 18.4, 20.5, 22.5, 23.2, 32.5, 33.5, 36.3, 37, 38.5, 39.5],
            music: "audio/okinawa.mp3",
        },
        {
            name: "Lake Victoria", //
            bpm: 140, //
            offset: 0,
            "beats-don": [1.4, 3.4, 3.9, 4.7, 5.6, 6.4, 7.3, 8.3, 8.7],
            "beats-ka": [9.9, 11.1, 12.5, 14, 15.3, 16.2, 16.9, 18.4, 19.6, 20.1, 20.7],
            music: "audio/keywest.mp3",
        }
    ]
};
